{
  "fullName":"Yu shako Jheng",
  "jobTitle":"Fullstack Engineer",
  "summary":{
    "title":"Software Developer",
    "description":[
      "I hold a Bachelor's degree in Computer Science and bring extensive experience as a software developer. My expertise lies in Angular 2, Node.js, Electron, and other JavaScript technologies. Over the past four years, I have been working on Angular 2+ projects based on the Electron platform.",
      "In my senior-level role in front-end development, I led the design and implementation of user interfaces, focusing on high performance and accessibility across multiple platforms. My deep understanding of JavaScript has been crucial in driving successful outcomes.",
      "I am confident that my coding background equips me to tackle any challenge and contribute to our company's success. I look forward to collaborating with the team to achieve great results."
    ]
  },
  "workExperience":{
    "iTrustWellnessGroup":{
      "companyName":"iTrust Wellness Group",
      "workDayRange":"Sep 2023 ~ 2024 Sep",
      "title":"Senior Front-End Developer",
      "local":"USA South Carolina Greenville (remote)",
      "description":[
        {
          "title":"Company Profile",
          "body":"I work a clinic that provides mental health care services. There are many patient services that must be digitized."
        },
        {
          "title":"Deployed a Node.js library server",
          "body":"ensuring scalable and reliable server management using Docker."
        },
        {
          "title":"Developed an Angular front-end platform",
          "body":" based on user stories, utilizing Angular's FormControl to dynamically load JSON data for improved user interaction."
        },
        {
          "title":"Configured AWS CodePipeline for CI/CD",
          "body":"enabling automated deployments and increasing development efficiency by 70%"
        },
        {
          "title":"Implemented Cypress for end-to-end automated testing",
          "body":"resulting in a 30% increase in testing efficiency and more robust application quality."
        },
        {
          "title":"Upgraded the project from Angular 15 to Angular 17",
          "body":"modernizing outdated code and achieving a 90% improvement in build efficiency, which facilitated the team's transition to writing code in the latest Angular 17 style."
        }
      ]
    },
    "ULICTekInc":{
      "companyName":"ULIC Tek Inc.",
      "workDayRange":"Jun 2019 ~ 2023 Aug",
      "title":"Software Development Engineer",
      "local":"Kaohsiung ,Taiwan",
      "description":[
        {
          "title":"Company Profile",
          "body":"This is a contract-based software company that provides software services for Corel, Acer, and other companies."
        },
        {
          "title":"Backend development",
          "body":"Bootstrapped a Node.js server using NestJS, which follows the MVC architecture, to implement OAuth2 authentication, upload photos to Amazon S3, and log user history."
        },
        {
          "title":"",
          "body":"Developed high-quality custom RESTful APIs with create, read, update, and delete (CRUD) features using .NET Core."
        },
        {
          "title":"",
          "body":"Integrated Entity Framework Core for database operations to optimize data functionality, consistency, and integrity."
        },
        {
          "title":"API document",
          "body":"Automated the generation of API documentation using Swagger to optimize team communication and improve quality by 50%."
        },
        {
          "title":"Database ORM",
          "body":"Added TypeORM and NestJS to interact with PostgreSQL using an ORM, avoiding traditional SQL queries to optimize serviceability."
        },
        {
          "title":"CI/CD",
          "body":"Published Docker image files to AWS Elastic Beanstalk and set up Jenkins scripts for automated publishing and bootstrapping to improve quality and stability."
        },
        {
          "title":"Electron desktop and frontend",
          "body":"Developed cross-platform software using Electron and Angular 15. Applied the Factory Pattern, allowing Mac and Windows systems to call the same classes but execute different behaviors, enhancing code reusability and system scalability."
        },
        {
          "title":"",
          "body":"Implemented JWT (JSON Web Token) authentication to ensure API security and user authorization."
        },
        {
          "title":"",
          "body":"Used Angular 15 and Angular Material for UI/UX creation to improve user experience and enhance UI development quality."
        },
        {
          "title":"",
          "body":"Integrated RxJS for handling asynchronous data flow, improving quality and speeding up workflows."
        }
      ]
    },
    "FootprintKu":{
      "companyName":"Foot Print Ku",
      "workDayRange":"Nov 2017 - May 2019",
      "title":"Front-End Developer",
      "local":"Kaohsiung ,Taiwan",
      "description":[
        {
          "title":"Campus AI Competition Official Website (Angular):",
          "body":"Designed and developed the CSS and HTML layouts for the entire website, and integrated RESTful APIs to bind and render data within Angular components."
        },
        {
          "title":"Showcase Design Platform:",
          "body":"Created and designed the CSS and HTML layouts for the entire website, and implemented the BEM methodology as the coding style specification for CSS."
        }
      ]
    }
  },
  "educationalBackground":{
    "dayRange":"Jun. 2012 - Aug. 2016",
    "name":"Shu-Te University (STU)",
    "title":"CSIE ,  Software Development"
  }
}